{"id":41,"date":"2023-02-23T13:40:03","date_gmt":"2023-02-23T13:40:03","guid":{"rendered":"https:\/\/wordpress-1065950-4321200.cloudwaysapps.com\/?p=41"},"modified":"2024-05-29T11:08:12","modified_gmt":"2024-05-29T11:08:12","slug":"kwara-gov-names-emir-of-lafiagi-a-u-mustapha-iyin-aboyeji-others-board-members-of-education-trust-fund","status":"publish","type":"post","link":"https:\/\/wordpress-1065950-4321200.cloudwaysapps.com\/2023\/02\/23\/kwara-gov-names-emir-of-lafiagi-a-u-mustapha-iyin-aboyeji-others-board-members-of-education-trust-fund\/","title":{"rendered":"Kwara Gov names Emir of Lafiagi, A.U. Mustapha, Iyin Aboyeji, others board members of Education Trust Fund"},"content":{"rendered":"\r\n<div style=\"height:46px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\r\n\r\n\r\n\r\n<p>• Damilola Amolegbe appointed Fund’s ES<\/p>\r\n\r\n\r\n\r\n<p><br>Kwara State Governor Abdulrahman Abdulrazaq has appointed a board for the state’s Education Trust Fund, with members drawn from great backgrounds.<\/p>\r\n\r\n\r\n\r\n<p>The Governor appointed philanthropist Abdulhakeem Uthman Mustapha (SAN) as the chairman of the Fund that is a strong component of the Kwara State Education Transformation Agenda (KWETA), and is designed to mobilise resources to support infrastructural development and growth in the public sector education in the state.<\/p>\r\n\r\n\r\n\r\n<p>KWETA had been borne out of the state’s Kwara Education Futures summit in 2021. Another component of it is the KwaraLEARN, which introduces technology and improved accountability and transparency to the basic education sector.<\/p>\r\n\r\n\r\n\r\n<p>A.U. Mustapha, as he is fondly called, is an alumnus of the Harvard Business School, Manchester Business School, Suffolk Law School, Business School Netherlands, Nigerian Law School, and Ahmadu Bello University Zaria.<\/p>\r\n\r\n\r\n\r\n<p>He is the principal partner at the A.U. Mustapha &amp; Co. law firm headquartered in Abuja, and is currently a member of the Tertiary Education Trust Fund’s Advisory Committee on Digital, Literacy, Productivity and Emerging Skills. He is President of the Confederation of African Football (CAF) Appeal’s Board.<\/p>\r\n\r\n\r\n\r\n<p>He is the 2nd Vice President of the Third Estate Foundation Ilorin, a coterie of statesmen who continually discuss public issues, community development, and offer support and advice.<\/p>\r\n\r\n\r\n\r\n<p>The Emir of Lafiagi Alhaji Mohammed Kudu Kawu, a strong advocate of eduction, is another influential member of the Fund.<\/p>\r\n\r\n\r\n\r\n<p>Kudu is renowned for his wealth of experience in the financial sector.<\/p>\r\n\r\n\r\n\r\n<p>Kemi Mary Adeosun, Permanent Secretary representative of the Ministry of Education Human Capital and Development, is also a member of the board as the representative of the Ministry.<\/p>\r\n\r\n\r\n\r\n<p>Iyinoluwa Aboyeji, holder of the national honour Officer of the Order of Niger, co-founder of Andela and former managing director of Flutterwave, is also on the board of the Fund.<\/p>\r\n\r\n\r\n\r\n<p>Iyinoluwa, general partner and co-founder of Future Africa that provides support for mission-driven innovators, is a renowned entrepreneur reputed to be one of 62 global founders of unicorns the size of Andela and Flutterwave.<\/p>\r\n\r\n\r\n\r\n<p>Deborah Adekeye (Ph.D), a senior lecturer in the Department of Sociology, University of Ilorin, is another board member of the Fund.<\/p>\r\n\r\n\r\n\r\n<p>The Fund will also kick-off with Oluwadamilola Fatimah Amolegbe as the Executive Secretary.<\/p>\r\n\r\n\r\n\r\n<p>Damilola, who collaborated with the Ministry of Education on the Kwara Education Futures Summit in 2021, has worked on some of Kwara’s transformational changes in education, including KWETA and KwaraLEARN.<\/p>\r\n\r\n\r\n\r\n<p>An alumnus of Manhattan College, New York City, and Vivian Fowler Memorial College, Lagos, Amolegbe is the founder of ‘W. Amolegbe Consulting.<\/p>\r\n\r\n\r\n\r\n<p>She sits on the boards and is a member of Dar Al-Awqaf, Okeya Community Development Association, Okeya-Ipo 100, She Builds Lives, and Reach Nigeria, among others.<\/p>\r\n\r\n\r\n\r\n<p>The Kwara State Education Trustfund board will grow to include more members to accommodate different demographies. The Fund can be reached at www.KWETF.NG along with its social media handles.<\/p>\r\n\r\n\r\n\r\n<p><br>Rafiu Ajakaye<br>Chief Press Secretary to the Governor<br>February 23, 2023<\/p>\r\n","protected":false},"excerpt":{"rendered":"<p>• Damilola Amolegbe appointed Fund’s ES Kwara State Governor Abdulrahman Abdulrazaq has appointed a board for the state’s Education Trust Fund, with members drawn from great<span class=\"excerpt-hellip\"> […]<\/span><\/p>\n","protected":false},"author":2,"featured_media":410,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/wordpress-1065950-4321200.cloudwaysapps.com\/wp-json\/wp\/v2\/posts\/41"}],"collection":[{"href":"https:\/\/wordpress-1065950-4321200.cloudwaysapps.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/wordpress-1065950-4321200.cloudwaysapps.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/wordpress-1065950-4321200.cloudwaysapps.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/wordpress-1065950-4321200.cloudwaysapps.com\/wp-json\/wp\/v2\/comments?post=41"}],"version-history":[{"count":3,"href":"https:\/\/wordpress-1065950-4321200.cloudwaysapps.com\/wp-json\/wp\/v2\/posts\/41\/revisions"}],"predecessor-version":[{"id":127,"href":"https:\/\/wordpress-1065950-4321200.cloudwaysapps.com\/wp-json\/wp\/v2\/posts\/41\/revisions\/127"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/wordpress-1065950-4321200.cloudwaysapps.com\/wp-json\/wp\/v2\/media\/410"}],"wp:attachment":[{"href":"https:\/\/wordpress-1065950-4321200.cloudwaysapps.com\/wp-json\/wp\/v2\/media?parent=41"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/wordpress-1065950-4321200.cloudwaysapps.com\/wp-json\/wp\/v2\/categories?post=41"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/wordpress-1065950-4321200.cloudwaysapps.com\/wp-json\/wp\/v2\/tags?post=41"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}