{"id":46,"date":"2023-11-26T13:40:52","date_gmt":"2023-11-26T13:40:52","guid":{"rendered":"https:\/\/wordpress-1065950-4321200.cloudwaysapps.com\/?p=46"},"modified":"2024-05-29T11:07:39","modified_gmt":"2024-05-29T11:07:39","slug":"gov-abdulrazaq-eyes-better-learning-outcomes-inaugurates-education-trust-fund-board","status":"publish","type":"post","link":"https:\/\/wordpress-1065950-4321200.cloudwaysapps.com\/2023\/11\/26\/gov-abdulrazaq-eyes-better-learning-outcomes-inaugurates-education-trust-fund-board\/","title":{"rendered":"Gov AbdulRazaq eyes better learning outcomes, inaugurates Education Trust Fund Board"},"content":{"rendered":"\r\n<div style=\"height:55px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\r\n\r\n\r\n\r\n<p>• Says investing in education is urgency of no<\/p>\r\n\r\n\r\n\r\n<p>• Philanthropist Mustapha SAN, mgt consultant Amolegbe, tech giant Aboyeji, education experts make list<\/p>\r\n\r\n\r\n\r\n<p>• Govt supports funds with N100m take-off grant<\/p>\r\n\r\n\r\n\r\n<p>• Board targets N10bn to drive education devt<\/p>\r\n\r\n\r\n\r\n<p>Kwara State Governor AbdulRahman AbdulRazaq has inaugurated members of the state Education Trust Fund Board, which he said will play a key role in helping to solidify educational transformation in the state.<\/p>\r\n\r\n\r\n\r\n<p>“The inauguration of the Kwara State Education Trust Fund Board today is another strategic step towards providing the right environment for excellent learning outcomes for the Kwara child and to enable sustainable development in our state,” he said late Friday in Ilorin, the state capital, at the brief ceremony.<\/p>\r\n\r\n\r\n\r\n<p>At the event were members of the state parliament and executive council, including the Chairman House of Assembly Committee on Education, Hon Baba Boriya; Secretary to the Kwara State Government, Prof Mamman Saba Jibril; Chief of Staff Prince Abdulkadir Mahe; Commissioner for Education and Human Capital Development, Hajia Sa’adatu Modibbo Kawu; Commissioner for Tertiary Education Dr Mary Arinde; Commissioner for Special Duties, Hon John Bello; and Senior Advisor and Counselor Sa’adu Salau.<\/p>\r\n\r\n\r\n\r\n<p>The Governor said the inauguration represents another phase in Kwara’s journey, touting some of the achievements of the administration in the sector, such as the massive school renewal projects and investments in training of teachers.<\/p>\r\n\r\n\r\n\r\n<p>“A few months ago at an education event on the sidelines of the United Nations General Assembly, I said that investing in education is the urgency of now. This notion has been the main driver of the many reforms we have carried out in the education sector,” he said.<\/p>\r\n\r\n\r\n\r\n<p>“We have up-skilled and resourced thousands of teachers, and empowered tens of thousands of students with essential learning materials and more conducive school environments.<\/p>\r\n\r\n\r\n\r\n<p>“Today, our teachers are reporting rapid improvements among their students. This growth is not only reported internally. Recently, Kwara passed the appraisal and was included in the World Bank’s Adolescent Girls Initiative for Learning and Empowerment programme. Our young girls are set to enjoy the benefits of Kwara AGILE.<\/p>\r\n\r\n\r\n\r\n<p>“Our children are already posting great performances on the national stage. You will see that from the recent UBEC school debate, which Kwara won again after having won last year’s edition and are set to represent Nigeria in the Republic of Serbia in Europe for an international school debate.<\/p>\r\n\r\n\r\n\r\n<p>“Notwithstanding these feats, we are not resting on our oars. If we are to deliver the promised dramatic improvements in learning outcomes in public schools for all children across Kwara State — and I promise you we will deliver — we need strong oversight, strategic direction, and resources that will ensure longevity.<\/p>\r\n\r\n\r\n\r\n<p>“This is where the Kwara State Education Trust Fund Board comes in. A critical component of our Kwara State Education Transformation Agenda (KWETA), the board will mobilise resources to support infrastructural development and growth in our education sector. It will help us build stakeholder partnerships and ensure our educational investments are effective, efficient, and aligned with our goals.<\/p>\r\n\r\n\r\n\r\n<p>“We have made a deliberate choice of the distinguished chairman, secretary, and every member of this board. Their great pedigrees speak clearly of what they bring to the table. I am confident, therefore, that the board will play a key role in helping to solidify educational transformation in Kwara State.”<\/p>\r\n\r\n\r\n\r\n<p>Kawu, for her part, said the inauguration of the Board will complement the investment of the present administration in the education sector.<\/p>\r\n\r\n\r\n\r\n<p>She said the Board would be practically private sector-driven, adding that “I’m particularly excited with the choice of the Chairman and esteemed members who have accepted to serve in this Board”.<\/p>\r\n\r\n\r\n\r\n<p>Members of the Board are Mallam Abdulhakeem Uthman Mustapha (SAN) (chairman);<br>Oluwadamilola Fatimah Amolegbe (Executive Secretary); Emir of Lafiagi Alhaji Mohammed Kudu-Kawu (Member); Permanent Secretary Ministry of Business Innovation and Technology, Mrs Kemi Mary Adeosun (Member);<br>Professor Deborah Adekeye (Member); and renowned tech giant Iyinoluwa Aboyeji (Member).<\/p>\r\n\r\n\r\n\r\n<p>Mustapha (SAN) commended the Governor for finding them worthy to serve in that capacity.<\/p>\r\n\r\n\r\n\r\n<p>He congratulated the administration for its huge investments in the education sector, adding: “What you are doing in the education sector in Kwara state is commendable. You are planting a tree for the future. It shows you are forward-thinking and you are trying to provide the workforce that will impart on our state.”<\/p>\r\n\r\n\r\n\r\n<p>He solicited the support of the government in order to achieve their goals, and pledged not to disappoint the administration and entire Kwarans.<\/p>\r\n\r\n\r\n\r\n<p>The chairman said the board looks forward to raising some N10bn from different stakeholders, especially private sector players and philanthropists, to support education infrastructure across Kwara State.<\/p>\r\n\r\n\r\n\r\n<p>The government, for its part, is to support the board with some N100m seed funds as it commences the assignment.<\/p>\r\n\r\n\r\n\r\n<p>Rafiu Ajakaye<br>Chief Press Secretary to the Governor<br>November 26, 2023<\/p>\r\n","protected":false},"excerpt":{"rendered":"<p>• Says investing in education is urgency of no • Philanthropist Mustapha SAN, mgt consultant Amolegbe, tech giant Aboyeji, education experts make list • Govt supports<span class=\"excerpt-hellip\"> […]<\/span><\/p>\n","protected":false},"author":2,"featured_media":410,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/wordpress-1065950-4321200.cloudwaysapps.com\/wp-json\/wp\/v2\/posts\/46"}],"collection":[{"href":"https:\/\/wordpress-1065950-4321200.cloudwaysapps.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/wordpress-1065950-4321200.cloudwaysapps.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/wordpress-1065950-4321200.cloudwaysapps.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/wordpress-1065950-4321200.cloudwaysapps.com\/wp-json\/wp\/v2\/comments?post=46"}],"version-history":[{"count":3,"href":"https:\/\/wordpress-1065950-4321200.cloudwaysapps.com\/wp-json\/wp\/v2\/posts\/46\/revisions"}],"predecessor-version":[{"id":125,"href":"https:\/\/wordpress-1065950-4321200.cloudwaysapps.com\/wp-json\/wp\/v2\/posts\/46\/revisions\/125"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/wordpress-1065950-4321200.cloudwaysapps.com\/wp-json\/wp\/v2\/media\/410"}],"wp:attachment":[{"href":"https:\/\/wordpress-1065950-4321200.cloudwaysapps.com\/wp-json\/wp\/v2\/media?parent=46"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/wordpress-1065950-4321200.cloudwaysapps.com\/wp-json\/wp\/v2\/categories?post=46"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/wordpress-1065950-4321200.cloudwaysapps.com\/wp-json\/wp\/v2\/tags?post=46"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}